# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# EyeWave-Transformer LITE: lightweight wavelet backbone + self-attention
# Optimised for eye-signal detection at 224×224 with minimal params (~800K-1M)
# Toggle transformer ON/OFF via last arg of SelfAttentionBlock (1=on, 0=off)

nc: 5  # open, closed, blink, gaze, saccade
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 512]   # ~800K params — target for fast CPU inference
  s: [0.50, 0.50, 512]   # ~2.5M params
  m: [0.50, 1.00, 384]
  l: [1.00, 1.00, 384]
  x: [1.00, 1.50, 384]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, EyeWaveBlock, [32]]           # 0-P1/2
  - [-1, 1, EyeWaveBlock, [64]]           # 1-P2/4
  - [-1, 1, C3k2, [64, False, 0.25]]      # 2
  - [-1, 1, EyeWaveBlock, [128]]          # 3-P3/8
  - [-1, 1, C3k2, [128, False, 0.25]]     # 4
  - [-1, 1, EyeWaveBlock, [256]]          # 5-P4/16
  - [-1, 1, C3k2, [256, True]]            # 6
  - [-1, 1, EyeWaveBlock, [512]]          # 7-P5/32
  - [-1, 1, C3k2, [512, True]]            # 8
  - [-1, 1, SelfAttentionBlock, [512, 4, 1]]  # 9 — QKV self-attention
  - [-1, 1, SPPF, [512, 5]]              # 10
  - [-1, 1, C2PSA, [512]]                # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 1, C3k2, [256, False]]      # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 1, C3k2, [128, False]]      # 17 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]       # cat head P4
  - [-1, 1, C3k2, [256, False]]      # 20 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]       # cat head P5
  - [-1, 1, C3k2, [512, True]]       # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
