# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# EyeWave + YOLO11 object detection model
# Replaces standard convolutional downsampling with EyeWaveBlock (LWS -> CSS -> SDB).
# Adds SpectralChannelAttention before SPPF.

nc: 5 # EyeWave classes (open, closed, blink, gaze, etc.)
scales: # model compound scaling constants, i.e. 'model=eyewave.yaml'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, EyeWaveBlock, [64]]   # 0-P1/2
  - [-1, 1, EyeWaveBlock, [128]]  # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, EyeWaveBlock, [256]]  # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, EyeWaveBlock, [512]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]    # 6
  - [-1, 1, EyeWaveBlock, [1024]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]   # 8
  - [-1, 1, SpectralChannelAttention, [1024]] # 9
  - [-1, 1, SPPF, [1024, 5]]      # 10
  - [-1, 2, C2PSA, [1024]]        # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
